---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.UseAnnotationScaleForSingleLineFittings
source: html/803e4b6a-85a0-fee5-830a-231cb89826b6.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.UseAnnotationScaleForSingleLineFittings Property

Indicates whether use annotation scale for single line fittings or not.

## Syntax (C#)
```csharp
public bool UseAnnotationScaleForSingleLineFittings { get; set; }
```